### Terraform Plan: `prod`

```
Acquiring state lock. This may take a few moments...
data.google_project.project: Reading...
data.google_project.project: Read complete after 0s [id=projects/quill-medical-production]
module.cloud_run_admin_job.google_cloud_run_v2_job.job: Preparing import... [id=projects/quill-medical-production/locations/europe-west2/jobs/quill-admin-prod]
module.cloud_run_admin_job.google_cloud_run_v2_job.job: Refreshing state... [id=projects/quill-medical-production/locations/europe-west2/jobs/quill-admin-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_artifact_registry_repository.docker will be created
  + resource "google_artifact_registry_repository" "docker" {
      + create_time      = (known after apply)
      + description      = "Container images for Quill Medical (prod)"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west2"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "quill-medical-production"
      + repository_id    = "quill"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_project_iam_member.cloudrun_secret_accessor will be created
  + resource "google_project_iam_member" "cloudrun_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:273011606298-compute@developer.gserviceaccount.com"
      + project = "quill-medical-production"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_secret_manager_secret_version.jwt_secret will be created
  + resource "google_secret_manager_secret_version" "jwt_secret" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = "projects/quill-medical-production/secrets/jwt-secret"
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # google_secret_manager_secret_version.vapid_private will be created
  + resource "google_secret_manager_secret_version" "vapid_private" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = "projects/quill-medical-production/secrets/vapid-private"
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # random_password.jwt_secret will be created
  + resource "random_password" "jwt_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.vapid_placeholder will be created
  + resource "random_password" "vapid_placeholder" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.cloud_run_backend.google_cloud_run_v2_service.service will be created
  + resource "google_cloud_run_v2_service" "service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west2"
      + name                    = "quill-backend-prod"
      + observed_generation     = (known after apply)
      + project                 = "quill-medical-production"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "gcr.io/cloudrun/hello:latest"

              + env {
                  + name  = "AUTH_DB_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "AUTH_DB_NAME"
                  + value = "quill_auth"
                }
              + env {
                  + name  = "AUTH_DB_USER"
                  + value = "quill"
                }
              + env {
                  + name  = "BACKEND_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "COOKIE_DOMAIN"
                  + value = ".quill-medical.com"
                }
              + env {
                  + name  = "EHRBASE_DB_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "EHRBASE_DB_NAME"
                  + value = "ehrbase"
                }
              + env {
                  + name  = "EHRBASE_DB_USER"
                  + value = "ehrbase"
                }
              + env {
                  + name  = "EHRBASE_URL"
                  + value = (known after apply)
                }
              + env {
                  + name  = "FHIR_DB_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "FHIR_DB_NAME"
                  + value = "fhir"
                }
              + env {
                  + name  = "FHIR_DB_USER"
                  + value = "fhir"
                }
              + env {
                  + name  = "FHIR_SERVER_URL"
                  + value = (known after apply)
                }
              + env {
                  + name  = "SECURE_COOKIES"
                  + value = "true"
                }
              + env {
                  + name = "AUTH_DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "auth-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "EHRBASE_API_ADMIN_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "ehrbase-admin-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "EHRBASE_API_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "ehrbase-api-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "EHRBASE_DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "ehrbase-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "FHIR_DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "fhir-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "JWT_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "jwt-secret"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "VAPID_PRIVATE"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "vapid-private"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 30
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/api/health"
                      + port = (known after apply)
                    }
                }

              + ports {
                  + container_port = 8000
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 6
                  + initial_delay_seconds = 5
                  + period_seconds        = 15
                  + timeout_seconds       = 10

                  + http_get {
                      + path = "/api/health"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.cloud_run_backend.google_cloud_run_v2_service_iam_member.public will be created
  + resource "google_cloud_run_v2_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west2"
      + member   = "allUsers"
      + name     = "quill-backend-prod"
      + project  = "quill-medical-production"
      + role     = "roles/run.invoker"
    }

  # module.cloud_run_frontend.google_cloud_run_v2_service.service will be created
  + resource "google_cloud_run_v2_service" "service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west2"
      + name                    = "quill-frontend-prod"
      + observed_generation     = (known after apply)
      + project                 = "quill-medical-production"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "gcr.io/cloudrun/hello:latest"

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 30
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/healthz"
                      + port = (known after apply)
                    }
                }

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 6
                  + initial_delay_seconds = 5
                  + period_seconds        = 15
                  + timeout_seconds       = 10

                  + http_get {
                      + path = "/healthz"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.cloud_run_frontend.google_cloud_run_v2_service_iam_member.public will be created
  + resource "google_cloud_run_v2_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west2"
      + member   = "allUsers"
      + name     = "quill-frontend-prod"
      + project  = "quill-medical-production"
      + role     = "roles/run.invoker"
    }

  # module.cloud_sql_auth.google_secret_manager_secret_version.db_password will be created
  + resource "google_secret_manager_secret_version" "db_password" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = "projects/quill-medical-production/secrets/auth-db-password"
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.cloud_sql_auth.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "quill-auth-prod"
      + name            = "quill_auth"
      + project         = "quill-medical-production"
      + self_link       = (known after apply)
    }

  # module.cloud_sql_auth.google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_18"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "quill-auth-prod"
      + private_ip_address             = (known after apply)
      + project                        = "quill-medical-production"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west2"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 30
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }

          + insights_config (known after apply)

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 3
              + update_track = "stable"
            }
        }
    }

  # module.cloud_sql_auth.google_sql_user.user will be created
  + resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "quill-auth-prod"
      + name                    = "quill"
      + password                = (sensitive value)
      + project                 = "quill-medical-production"
      + sql_server_user_details = (known after apply)
    }

  # module.cloud_sql_auth.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.cloud_sql_ehrbase[0].google_secret_manager_secret_version.db_password will be created
  + resource "google_secret_manager_secret_version" "db_password" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = "projects/quill-medical-production/secrets/ehrbase-db-password"
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.cloud_sql_ehrbase[0].google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "quill-ehrbase-prod"
      + name            = "ehrbase"
      + project         = "quill-medical-production"
      + self_link       = (known after apply)
    }

  # module.cloud_sql_ehrbase[0].google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_18"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "quill-ehrbase-prod"
      + private_ip_address             = (known after apply)
      + project                        = "quill-medical-production"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west2"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 30
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }

          + insights_config (known after apply)

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 3
              + update_track = "stable"
            }
        }
    }

  # module.cloud_sql_ehrbase[0].google_sql_user.user will be created
  + resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "quill-ehrbase-prod"
      + name                    = "ehrbase"
      + password                = (sensitive value)
      + project                 = "quill-medical-production"
      + sql_server_user_details = (known after apply)
    }

  # module.cloud_sql_ehrbase[0].random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.cloud_sql_fhir[0].google_secret_manager_secret_version.db_password will be created
  + resource "google_secret_manager_secret_version" "db_password" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = "projects/quill-medical-production/secrets/fhir-db-password"
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.cloud_sql_fhir[0].google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "quill-fhir-prod"
      + name            = "fhir"
      + project         = "quill-medical-production"
      + self_link       = (known after apply)
    }

  # module.cloud_sql_fhir[0].google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_18"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "quill-fhir-prod"
      + private_ip_address             = (known after apply)
      + project                        = "quill-medical-production"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west2"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 30
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }

          + insights_config (known after apply)

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 3
              + update_track = "stable"
            }
        }
    }

  # module.cloud_sql_fhir[0].google_sql_user.user will be created
  + resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "quill-fhir-prod"
      + name                    = "fhir"
      + password                = (sensitive value)
      + project                 = "quill-medical-production"
      + sql_server_user_details = (known after apply)
    }

  # module.cloud_sql_fhir[0].random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.compute_fhir[0].google_compute_instance.fhir will be created
  + resource "google_compute_instance" "fhir" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = (known after apply)
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-small"
      + metadata                  = (known after apply)
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "fhir-ehrbase-prod"
      + project                   = "quill-medical-production"
      + self_link                 = (known after apply)
      + tags                      = [
          + "allow-health-check",
          + "allow-iap-ssh",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = (known after apply)
      + zone                      = "europe-west2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "projects/cos-cloud/global/images/family/cos-stable"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = 30
              + type                   = "pd-standard"
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = true
          + enable_vtpm                 = true
        }
    }

  # module.compute_fhir[0].google_project_iam_member.fhir_vm_log_writer will be created
  + resource "google_project_iam_member" "fhir_vm_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "quill-medical-production"
      + role    = "roles/logging.logWriter"
    }

  # module.compute_fhir[0].google_project_iam_member.fhir_vm_secret_accessor will be created
  + resource "google_project_iam_member" "fhir_vm_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "quill-medical-production"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.compute_fhir[0].google_service_account.fhir_vm will be created
  + resource "google_service_account" "fhir_vm" {
      + account_id   = "fhir-vm-prod"
      + disabled     = false
      + display_name = "FHIR + EHRbase VM (prod)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "quill-medical-production"
      + unique_id    = (known after apply)
    }

  # module.load_balancer.google_compute_backend_bucket.landing[0] will be created
  + resource "google_compute_backend_bucket" "landing" {
      + bucket_name        = "quill-medical-production-landing"
      + creation_timestamp = (known after apply)
      + enable_cdn         = true
      + id                 = (known after apply)
      + name               = "quill-landing-prod"
      + project            = "quill-medical-production"
      + self_link          = (known after apply)

      + cdn_policy (known after apply)
    }

  # module.load_balancer.google_compute_backend_service.backend will be created
  + resource "google_compute_backend_service" "backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "quill-bs-backend-prod"
      + port_name                       = (known after apply)
      + project                         = "quill-medical-production"
      + protocol                        = "HTTP"
      + security_policy                 = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + cdn_policy (known after apply)

      + log_config {
          + enable      = true
          + sample_rate = 1
        }
    }

  # module.load_balancer.google_compute_backend_service.frontend will be created
  + resource "google_compute_backend_service" "frontend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "quill-bs-frontend-prod"
      + port_name                       = (known after apply)
      + project                         = "quill-medical-production"
      + protocol                        = "HTTP"
      + security_policy                 = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + cdn_policy (known after apply)

      + log_config {
          + enable      = true
          + sample_rate = 1
        }
    }

  # module.load_balancer.google_compute_global_address.lb_ip will be created
  + resource "google_compute_global_address" "lb_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "quill-lb-ip-prod"
      + prefix_length      = (known after apply)
      + project            = "quill-medical-production"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.load_balancer.google_compute_global_forwarding_rule.http will be created
  + resource "google_compute_global_forwarding_rule" "http" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "quill-http-rule-prod"
      + network               = (known after apply)
      + port_range            = "80"
      + project               = "quill-medical-production"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.load_balancer.google_compute_global_forwarding_rule.https will be created
  + resource "google_compute_global_forwarding_rule" "https" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "quill-https-rule-prod"
      + network               = (known after apply)
      + port_range            = "443"
      + project               = "quill-medical-production"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.load_balancer.google_compute_managed_ssl_certificate.cert will be created
  + resource "google_compute_managed_ssl_certificate" "cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "quill-cert-v4-prod"
      + project                   = "quill-medical-production"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "app.quill-medical.com",
              + "quill-medical.com",
              + "www.quill-medical.com",
            ]
        }
    }

  # module.load_balancer.google_compute_region_network_endpoint_group.backend will be created
  + resource "google_compute_region_network_endpoint_group" "backend" {
      + id                    = (known after apply)
      + name                  = "quill-neg-backend-prod"
      + network_endpoint_type = "SERVERLESS"
      + project               = "quill-medical-production"
      + region                = "europe-west2"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "quill-backend-prod"
        }
    }

  # module.load_balancer.google_compute_region_network_endpoint_group.frontend will be created
  + resource "google_compute_region_network_endpoint_group" "frontend" {
      + id                    = (known after apply)
      + name                  = "quill-neg-frontend-prod"
      + network_endpoint_type = "SERVERLESS"
      + project               = "quill-medical-production"
      + region                = "europe-west2"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "quill-frontend-prod"
        }
    }

  # module.load_balancer.google_compute_security_policy.waf will be created
  + resource "google_compute_security_policy" "waf" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "quill-waf-prod"
      + project     = "quill-medical-production"
      + self_link   = (known after apply)
      + type        = (known after apply)

      + advanced_options_config (known after apply)

      + rule {
          + action      = "allow"
          + description = "Default: allow all traffic"
          + preview     = (known after apply)
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
      + rule {
          + action      = "throttle"
          + description = "Rate limit: 500 req/min per IP"
          + preview     = (known after apply)
          + priority    = 1000

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }

          + rate_limit_options {
              + conform_action      = "allow"
              + exceed_action       = "deny(429)"
                # (2 unchanged attributes hidden)

              + rate_limit_threshold {
                  + count        = 500
                  + interval_sec = 60
                }
            }
        }
    }

  # module.load_balancer.google_compute_target_http_proxy.http will be created
  + resource "google_compute_target_http_proxy" "http" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "quill-http-proxy-prod"
      + project            = "quill-medical-production"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.load_balancer.google_compute_target_https_proxy.https will be created
  + resource "google_compute_target_https_proxy" "https" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "quill-https-proxy-prod"
      + project            = "quill-medical-production"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.load_balancer.google_compute_url_map.http_redirect will be created
  + resource "google_compute_url_map" "http_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "quill-http-redirect-prod"
      + project            = "quill-medical-production"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

  # module.load_balancer.google_compute_url_map.https will be created
  + resource "google_compute_url_map" "https" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "quill-url-map-prod"
      + project            = "quill-medical-production"
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "app.quill-medical.com",
            ]
          + path_matcher = "quill-paths"
            # (1 unchanged attribute hidden)
        }
      + host_rule {
          + hosts        = [
              + "quill-medical.com",
              + "www.quill-medical.com",
            ]
          + path_matcher = "landing"
            # (1 unchanged attribute hidden)
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "quill-paths"

          + path_rule {
              + paths   = [
                  + "/api",
                  + "/api/*",
                ]
              + service = (known after apply)
            }
        }
      + path_matcher {
          + default_service = (known after apply)
          + name            = "landing"
        }
    }

  # module.load_balancer.google_storage_bucket.landing[0] will be created
  + resource "google_storage_bucket" "landing" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "quill-medical-production-landing"
      + project                     = "quill-medical-production"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "not-found.html"
        }
    }

  # module.load_balancer.google_storage_bucket_iam_member.landing_public[0] will be created
  + resource "google_storage_bucket_iam_member" "landing_public" {
      + bucket = "quill-medical-production-landing"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

  # module.monitoring.google_monitoring_alert_policy.uptime will be created
  + resource "google_monitoring_alert_policy" "uptime" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Uptime failure (prod)"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "quill-medical-production"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Uptime check failed: Health — app.quill-medical.com"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.label.project_id",
                      + "resource.label.host",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count = 1
                }
            }
        }
      + conditions {
          + display_name = "Uptime check failed: Health — quill-medical.com"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.label.project_id",
                      + "resource.label.host",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count = 1
                }
            }
        }
    }

  # module.monitoring.google_monitoring_notification_channel.email will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Quill alerts (prod)"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "alerts@quill-medical.com"
        }
      + name                = (known after apply)
      + project             = "quill-medical-production"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # module.monitoring.google_monitoring_uptime_check_config.health["app.quill-medical.com"] will be created
  + resource "google_monitoring_uptime_check_config" "health" {
      + checker_type    = (known after apply)
      + display_name    = "Health — app.quill-medical.com"
      + id              = (known after apply)
      + name            = (known after apply)
      + period          = "300s"
      + project         = "quill-medical-production"
      + timeout         = "10s"
      + uptime_check_id = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/api/health"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = {
              + "host"       = "app.quill-medical.com"
              + "project_id" = "quill-medical-production"
            }
          + type   = "uptime_url"
        }
    }

  # module.monitoring.google_monitoring_uptime_check_config.health["quill-medical.com"] will be created
  + resource "google_monitoring_uptime_check_config" "health" {
      + checker_type    = (known after apply)
      + display_name    = "Health — quill-medical.com"
      + id              = (known after apply)
      + name            = (known after apply)
      + period          = "300s"
      + project         = "quill-medical-production"
      + timeout         = "10s"
      + uptime_check_id = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/api/health"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = {
              + "host"       = "quill-medical.com"
              + "project_id" = "quill-medical-production"
            }
          + type   = "uptime_url"
        }
    }

  # module.networking.google_compute_firewall.allow_health_check will be created
  + resource "google_compute_firewall" "allow_health_check" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-health-check-prod"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "quill-medical-production"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]
      + target_tags        = [
          + "allow-health-check",
        ]

      + allow {
          + ports    = [
              + "8000",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.networking.google_compute_firewall.allow_iap_ssh will be created
  + resource "google_compute_firewall" "allow_iap_ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-iap-ssh-prod"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "quill-medical-production"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]
      + target_tags        = [
          + "allow-iap-ssh",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.networking.google_compute_firewall.deny_db_ingress will be created
  + resource "google_compute_firewall" "deny_db_ingress" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "deny-db-ingress-prod"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "quill-medical-production"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + deny {
          + ports    = [
              + "5432",
            ]
          + protocol = "tcp"

... (truncated)
```

*Workflow:* https://github.com/bailey-medics/quillmedical/actions/runs/23564795962